import { AnswerType } from '../types/answerType';
export const answers: AnswerType[] = [
  {
    id: 'question1',
    question: 'Q1.どのくらいの頻度で活動すればいいの？',
    answer:
      'A.基本的に自由です！\nこのサークルでは基本的に独学で自分がやりたい内容を家でやったり、工房に来てみんなとやったりします。\n定期的に行われるイベントにも参加できます',
  },
  {
    id: 'question2',
    question: 'Q2.お金はかかるの？',
    answer:
      'A.無料です！工房に来ればスマホの実機端末やプロジェクターVR,ドローンなど様々な機器を自由に使うことができます！',
  },
  {
    id: 'question3',
    question: 'Q3.九工大じゃなくても大丈夫？',
    answer:
      'A.どなたでも歓迎です！\n戸畑キャンパスだけでなく、飯塚キャンパスや他大の学生も多く在籍しています！\nオンラインの活動も行っているのでぜひ相談してみてください！',
  },
  {
    id: 'question4',
    question: 'Q4.全くプログラミングについて知らないけど大丈夫？',
    answer:
      'A.初心者の人も大歓迎です！\nほとんどの人が大学からプログラミングを始めています\nもともと文系だった人さえも在籍しています\n大学からパソコンを扱い始めた人も多いので、PCに慣れていない人でも気軽に相談ください！',
  },
  {
    id: 'question5',
    question: 'Q5.兼部、兼サークルはできるの？',
    answer:
      'A.できます！参加頻度も自由なので時間があれば参加という形で大丈夫です',
  },
  {
    id: 'question6',
    question: 'Q6.どれぐらいでプログラミングってできるようになるの？',
    answer:
      'A.やる気次第です\nこのサークルは基本的に独学がメインなので、参加しているだけではプログラミングができるようにはなりません\nイベントなどは定期的に行っているので、積極的に参加していって経験を積めばできるようになります\n具体的には参加して３ヶ月でアプリをリリースした人もいます',
  },
];
